<?php

return [

    'accepted' => ':attribute ஐ ஏற்றுக்கொள்ள வேண்டும்.',
    'accepted_if' => ':other இன் மதிப்பு :value ஆக இருந்தால், :attribute ஐ ஏற்றுக்கொள்ள வேண்டும்.',
    'active_url' => ':attribute சரியான URL ஆக இல்லை.',
    'after' => ':attribute என்பது :date அன்று பிறகு வர்த்தமான நாள் ஆக இருக்க வேண்டும்.',
    'after_or_equal' => ':attribute என்பது :date அன்று பிறகு அல்லது சமம் ஆக இருக்க வேண்டும்.',
    'alpha' => ':attribute மட்டும் எழுத்துக்களைக் கொண்டிருக்க வேண்டும்.',
    'alpha_dash' => ':attribute என்பது எழுத்துகள், எண்கள், டேஷ் மற்றும் ஓர் வரிகளைக் கொண்டிருக்க வேண்டும்.',
    'alpha_num' => ':attribute என்பது எழுத்துகள் மற்றும் எண்களைக் கொண்டிருக்க வேண்டும்.',
    'array' => ':attribute என்பது ஒரு அணி ஆக இருக்க வேண்டும்.',
    'before' => ':attribute என்பது :date அன்று முன்பாக வர்த்தமான நாள் ஆக இருக்க வேண்டும்.',
    'before_or_equal' => ':attribute என்பது :date அன்று முன்பாக அல்லது சமம் ஆக இருக்க வேண்டும்.',
    'between' => [
        'array' => ':attribute என்பது :min மற்றும் :max உருப்படிகள் கொண்டிருப்பது வேண்டும்.',
        'file' => ':attribute என்பது :min மற்றும் :max கிலோபைட்டுகளுக்குள் இருக்க வேண்டும்.',
        'numeric' => ':attribute என்பது :min மற்றும் :max இடையே இருக்க வேண்டும்.',
        'string' => ':attribute என்பது :min மற்றும் :max எழுத்துக்களைக் கொண்டிருக்க வேண்டும்.',
    ],
    'boolean' => ':attribute புலம் உண்மை அல்லது பொய்யாக இருக்க வேண்டும்.',
    'confirmed' => ':attribute உறுதிப்படுத்தல் பொருந்தவில்லை.',
    'current_password' => 'கடவுச்சொல் தவறானது.',
    'date' => ':attribute சரியான தேதி ஆக இல்லை.',
    'date_equals' => ':attribute என்பது :date அன்று சமமான தேதி ஆக இருக்க வேண்டும்.',
    'date_format' => ':attribute என்பது :format வடிவமைப்புடன் பொருந்தவில்லை.',
    'declined' => ':attribute மறுக்கப்பட வேண்டும்.',
    'declined_if' => ':other இன் மதிப்பு :value ஆக இருந்தால், :attribute மறுக்கப்பட வேண்டும்.',
    'different' => ':attribute மற்றும் :other வேறுபட்டதாக இருக்க வேண்டும்.',
    'digits' => ':attribute என்பது :digits எண்களை கொண்டிருக்க வேண்டும்.',
    'digits_between' => ':attribute என்பது :min மற்றும் :max இடையே எண்களை கொண்டிருக்க வேண்டும்.',
    'dimensions' => ':attribute இன் படத்தை பரிமாணங்கள் தவறானவை.',
    'distinct' => ':attribute புலத்தில் ஒரு முறைபாடான மதிப்பு உள்ளது.',
    'doesnt_start_with' => ':attribute கீழ்காணும் ஒன்றின் மேல் தொடங்கக்கூடாது: :values.',
    'email' => ':attribute என்பது சரியான மின்னஞ்சல் முகவரி ஆக இருக்க வேண்டும்.',
    'ends_with' => ':attribute கீழ்காணும் ஒன்றில் முடிவடைய வேண்டும்: :values.',
    'enum' => 'தேர்ந்தெடுக்கப்பட்ட :attribute தவறானது.',
    'exists' => 'தேர்ந்தெடுக்கப்பட்ட :attribute தவறானது.',
    'file' => ':attribute என்பது ஒரு கோப்பாக இருக்க வேண்டும்.',
    'filled' => ':attribute புலத்தில் ஒரு மதிப்பு இருக்க வேண்டும்.',
    'gt' => [
        'array' => ':attribute :value உருப்படிகளுக்கு மேல் இருக்க வேண்டும்.',
        'file' => ':attribute :value கிலோபைட்டுகளுக்கு மேல் இருக்க வேண்டும்.',
        'numeric' => ':attribute :value க்கு மேல் இருக்க வேண்டும்.',
        'string' => ':attribute :value எழுத்துக்களுக்குக் கீழாக இருக்க வேண்டும்.',
    ],
    'gte' => [
        'array' => ':attribute :value உருப்படிகள் அல்லது அதற்கு மேல் இருக்க வேண்டும்.',
        'file' => ':attribute :value கிலோபைட்டுகளுக்கு மேல் அல்லது சமமாக இருக்க வேண்டும்.',
        'numeric' => ':attribute :value க்கு மேல் அல்லது சமமாக இருக்க வேண்டும்.',
        'string' => ':attribute :value எழுத்துக்களுக்கு மேல் அல்லது சமமாக இருக்க வேண்டும்.',
    ],
    'image' => ':attribute என்பது ஒரு படம் ஆக இருக்க வேண்டும்.',
    'in' => 'தேர்ந்தெடுக்கப்பட்ட :attribute தவறானது.',
    'in_array' => ':attribute புலம் :other இல் காணப்படவில்லை.',
    'integer' => ':attribute என்பது ஒரு முழு எண் ஆக இருக்க வேண்டும்.',
    'ip' => ':attribute என்பது சரியான IP முகவரி ஆக இருக்க வேண்டும்.',
    'ipv4' => ':attribute என்பது சரியான IPv4 முகவரி ஆக இருக்க வேண்டும்.',
    'ipv6' => ':attribute என்பது சரியான IPv6 முகவரி ஆக இருக்க வேண்டும்.',
    'json' => ':attribute என்பது சரியான JSON சங்கடம் ஆக இருக்க வேண்டும்.',
    'lt' => [
        'array' => ':attribute :value உருப்படிகளுக்கு குறைவாக இருக்க வேண்டும்.',
        'file' => ':attribute :value கிலோபைட்டுகளுக்கு குறைவாக இருக்க வேண்டும்.',
        'numeric' => ':attribute :value க்கு குறைவாக இருக்க வேண்டும்.',
        'string' => ':attribute :value எழுத்துக்களுக்குக் குறைவாக இருக்க வேண்டும்.',
    ],
    'lte' => [
        'array' => ':attribute :value உருப்படிகளுக்கு மேல் அல்லது அதற்கு சமமாக இருக்க கூடாது.',
        'file' => ':attribute :value கிலோபைட்டுகளுக்கு குறைவாக அல்லது சமமாக இருக்க வேண்டும்.',
        'numeric' => ':attribute :value க்கு குறைவாக அல்லது சமமாக இருக்க வேண்டும்.',
        'string' => ':attribute :value எழுத்துக்களுக்கு குறைவாக அல்லது சமமாக இருக்க வேண்டும்.',
    ],
    'mac_address' => ':attribute என்பது சரியான MAC முகவரியாக இருக்க வேண்டும்.',
    'max' => [
        'array' => ':attribute :max உருப்படிகளுக்கு மேல் இருக்க கூடாது.',
        'file' => ':attribute :max கிலோபைட்டுகளுக்கு மேல் இருக்க கூடாது.',
        'numeric' => ':attribute :max க்கு மேல் இருக்க கூடாது.',
        'string' => ':attribute :max எழுத்துக்களுக்குக் மேல் இருக்க கூடாது.',
    ],
    'mimes' => ':attribute என்பது :values வகை கோப்பு ஆக இருக்க வேண்டும்.',
    'mimetypes' => ':attribute என்பது :values வகை கோப்பு ஆக இருக்க வேண்டும்.',
    'min' => [
        'array' => ':attribute :min உருப்படிகள் கொண்டிருக்க வேண்டும்.',
        'file' => ':attribute :min கிலோபைட்டுகளுக்கு குறைவாக இருக்க வேண்டும்.',
        'numeric' => ':attribute :min க்கு குறைவாக இருக்க வேண்டும்.',
        'string' => ':attribute :min எழுத்துக்களுக்குக் குறைவாக இருக்க வேண்டும்.',
    ],
    'multiple_of' => ':attribute என்பது :value இன் பலகோபானாக இருக்க வேண்டும்.',
    'not_in' => 'தேர்ந்தெடுக்கப்பட்ட :attribute தவறானது.',
    'not_regex' => ':attribute வடிவமைப்பு தவறானது.',
    'numeric' => ':attribute என்பது ஒரு எண் ஆக இருக்க வேண்டும்.',
    'password' => [
        'letters' => ':attribute க்குள் குறைந்தது ஒரு எழுத்து இருக்க வேண்டும்.',
        'mixed' => ':attribute க்குள் குறைந்தது ஒரு பெரிய எழுத்து மற்றும் ஒரு சிறிய எழுத்து இருக்க வேண்டும்.',
        'numbers' => ':attribute க்குள் குறைந்தது ஒரு எண் இருக்க வேண்டும்.',
        'symbols' => ':attribute க்குள் குறைந்தது ஒரு சின்னம் இருக்க வேண்டும்.',
        'uncompromised' => ':attribute தரவு தொலைத்தல் உள்ளதாக உள்ளது. வேறுபட்ட :attribute தேர்ந்தெடுக்கவும்.',
    ],
    'present' => ':attribute புலம் இருக்க வேண்டும்.',
    'prohibited' => ':attribute புலம் தடைசெய்யப்பட்டுள்ளது.',
    'prohibited_if' => ':other என்பது :value என்றால் :attribute புலம் தடைசெய்யப்பட்டுள்ளது.',
    'prohibited_unless' => ':other :values இல் இல்லையென்றால் :attribute புலம் தடைசெய்யப்பட்டுள்ளது.',
    'prohibits' => ':attribute புலம் :other ஐ இருக்க கூடாது என்று தடைசெய்கிறது.',
    'regex' => ':attribute வடிவமைப்பு தவறானது.',
    'required' => ':attribute புலம் அவசியம் உள்ளது.',
    'required_array_keys' => ':attribute புலம் :values இற்கான உள்ளீடுகளை கொண்டிருக்க வேண்டும்.',
    'required_if' => ':other என்பது :value என்றால் :attribute புலம் அவசியமாக உள்ளது.',
    'required_unless' => ':other :values இல் இல்லையென்றால் :attribute புலம் அவசியமாக உள்ளது.',
    'required_with' => ':values இருப்பின் :attribute புலம் அவசியமாக உள்ளது.',
    'required_with_all' => ':values அனைத்து இருப்பின் :attribute புலம் அவசியமாக உள்ளது.',
    'required_without' => ':values இல்லாதபோது :attribute புலம் அவசியமாக உள்ளது.',
    'required_without_all' => ':values ஒன்றுமில்லை என்றால் :attribute புலம் அவசியமாக உள்ளது.',
    'same' => ':attribute மற்றும் :other ஒரே மாதிரியாக இருக்க வேண்டும்.',
    'size' => [
        'array' => ':attribute இல் :size உருப்படிகள் இருக்க வேண்டும்.',
        'file' => ':attribute :size கிலோபைட்டுகளாக இருக்க வேண்டும்.',
        'numeric' => ':attribute :size ஆக இருக்க வேண்டும்.',
        'string' => ':attribute :size எழுத்துக்களாக இருக்க வேண்டும்.',
    ],
    'starts_with' => ':attribute கீழ்காணும் ஒன்றில் தொடங்க வேண்டும்: :values.',
    'string' => ':attribute என்பது ஒரு எழுத்து சரம் ஆக இருக்க வேண்டும்.',
    'timezone' => ':attribute என்பது ஒரு சரியான கால மண்டலம் ஆக இருக்க வேண்டும்.',
    'unique' => ':attribute ஏற்கனவே எடுக்கப்பட்டுள்ளது.',
    'uploaded' => ':attribute பதிவேற்றம் செய்ய தோல்வியுற்றது.',
    'url' => ':attribute என்பது ஒரு சரியான URL ஆக இருக்க வேண்டும்.',
    'uuid' => ':attribute என்பது ஒரு சரியான UUID ஆக இருக்க வேண்டும்.',
    'attributes' => [],
    'publish_date_required' => 'பரப்புப் பொது தேதி அவசியம்.',
    'price_numeric_value' => 'விலை ஒரு எண்மையான மதிப்பு இருக்க வேண்டும்.',
    'quantity_integer_value' => 'பரிமாணம் ஒரு முழு எண் மதிப்பு ஆக இருக்க வேண்டும்.',
    'order_has_Expired' => 'ஆர்டர் காலாவதியானது.',
    'expired' => 'காலாவதியானது.',
    /*
       கோரிக்கை கோப்பு தனிப்பயன் சரிபார்ப்பு செய்தியுகள்
    */

    //பொதுவாக
    'settings_form' => [
        'company' => [
            'required' => 'நிறுவனத்தின் புலம் அவசியம்.',
        ],
        'website' => [
            'url' => 'தளமானது சரியான URL ஆக இருக்க வேண்டும்.',
        ],
        'phone' => [
            'regex' => 'தொலைபேசி எண் வடிவமைப்பு தவறானது.',
        ],
        'address' => [
            'required' => 'முகவரி புலம் அவசியம்.',
            'max' => 'முகவரி 300 எழுத்துகளுக்கு மேல் இருக்க கூடாது.',
        ],
        'logo' => [
            'mimes' => 'படிகோப்பு ஒரு PNG கோப்பு ஆக இருக்க வேண்டும்.',
        ],
        'driver' => [
            'required' => 'கட்டுப்பாட்டாளர் புலம் அவசியம்.',
        ],
        'port' => [
            'integer' => 'போர்ட் ஒரு முழு எண் ஆக இருக்க வேண்டும்.',
        ],
        'email' => [
            'required' => 'மின்னஞ்சல் புலம் அவசியம்.',
            'email' => 'மின்னஞ்சல் சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்.',
        ],
        'password' => [
            'required' => 'கடவுச்சொல் புலம் அவசியம்.',
        ],
        'error_email' => [
            'email' => 'பிழை மின்னஞ்சல் சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்.',
        ],
    ],

    'settings_forms' => [
        'company' => [
            'required' => 'நிறுவனத்தின் பெயர் அவசியம்.',
            'max' => 'நிறுவனத்தின் பெயர் 50 எழுத்துகளுக்கு மேல் இருக்க கூடாது.',
        ],
        'company_email' => [
            'required' => 'நிறுவனத்தின் மின்னஞ்சல் அவசியம்.',
            'email' => 'நிறுவனத்தின் மின்னஞ்சல் சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்.',
        ],
        'title' => [
            'max' => 'தலைப்பு 50 எழுத்துகளுக்கு மேல் இருக்க கூடாது.',
        ],
        'website' => [
            'required' => 'தள URL அவசியம்.',
            'url' => 'தளம் சரியான URL ஆக இருக்க வேண்டும்.',
            'regex' => 'தள வடிவமைப்பு தவறானது.',
        ],
        'phone' => [
            'required' => 'தொலைபேசி எண் அவசியம்.',
        ],
        'address' => [
            'required' => 'முகவரி அவசியம்.',
        ],
        'state' => [
            'required' => 'மாநிலம் அவசியம்.',
        ],
        'country' => [
            'required' => 'நாடு அவசியம்.',
        ],
        'gstin' => [
            'max' => 'GSTIN 15 எழுத்துகளுக்கு மேல் இருக்க கூடாது.',
        ],
        'default_currency' => [
            'required' => 'உள்ளமைத் துவக்க வாணிப நிலை அவசியம்.',
        ],
        'admin_logo' => [
            'mimes' => 'அடிப்படையில் பாணியினால் நிரல் வடிவம்: jpeg, png, jpg.',
            'max' => 'அடிப்படையில் புதிய உருவாக்கும் 2MB அதிகமாக இருக்க கூடாது.',
        ],
        'fav_icon' => [
            'mimes' => 'பட்டியலின் படங்கள் வண்ணங்களில் வடிவமைப்பு jpeg, png, jpg.',
            'max' => 'பட்டியலின் படங்கள் 2MB வரை இருக்க வேண்டும்.',
        ],
        'logo' => [
            'mimes' => 'உரை வடிவமைப்பு jpeg, png, jpg.',
            'max' => 'பொருந்திய ஊழியக்குடாளிற்ப்பு .files .mbrs .shorcut [colors]-button .gff matching .txt .stmt styles%/.cptype',
        ],
    ],
    'social_media_form' => [
        'name' => [
            'required' => 'பெயர் புலம் அவசியம்.',
            'unique' => 'இந்த பெயர் ஏற்கனவே உள்ளது.',
            'max' => 'பெயர் 50 எழுத்துகளுக்கு அதிகமாக இருக்க முடியாது.',
        ],
        'link' => [
            'required' => 'இணைப்பு புலம் அவசியம்.',
            'url' => 'இணைப்பு சரியான URL ஆக இருக்க வேண்டும்.',
            'regex' => 'இணைப்பு வடிவமைப்பு தவறானது.',
        ],
    ],

    //மின்னஞ்சல்
    'custom' => [
        'password' => [
            'required_if' => 'தேர்ந்த மின்னஞ்சல் இயக்கி உடன் கடவுச்சொல் புலம் அவசியம்.',
        ],
        'port' => [
            'required_if' => 'SMTP உடன் போர்ட் புலம் அவசியம்.',
        ],
        'encryption' => [
            'required_if' => 'SMTP உடன் குறியாக்கம் புலம் அவசியம்.',
        ],
        'host' => [
            'required_if' => 'SMTP உடன் ஹோஸ்ட் புலம் அவசியம்.',
        ],
        'secret' => [
            'required_if' => 'தேர்ந்த மின்னஞ்சல் இயக்கி உடன் ரகசிய புலம் அவசியம்.',
        ],
        'domain' => [
            'required_if' => 'Mailgun உடன் வலைதள புலம் அவசியம்.',
        ],
        'key' => [
            'required_if' => 'SES உடன் திறவுகோல் புலம் அவசியம்.',
        ],
        'region' => [
            'required_if' => 'SES உடன் பிரதேச புலம் அவசியம்.',
        ],
        'email' => [
            'required_if' => 'தேர்ந்த மின்னஞ்சல் இயக்கி உடன் மின்னஞ்சல் புலம் அவசியம்.',
            'required' => 'மின்னஞ்சல் புலம் அவசியம்.',
            'email' => 'சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்.',
            'not_matching' => 'மின்னஞ்சல் டொமைன் தற்போது உள்ள தளத்தின் டொமைனுடன் பொருந்த வேண்டும்.',
        ],
        'driver' => [
            'required' => 'இயக்கி புலம் அவசியம்.',
        ],
    ],
    'customer_form' => [
        'first_name' => [
            'required' => 'முதல் பெயர் புலம் அவசியம்.',
        ],
        'last_name' => [
            'required' => 'கடைசி பெயர் புலம் அவசியம்.',
        ],
        'company' => [
            'required' => 'நிறுவன புலம் அவசியம்.',
        ],
        'mobile' => [
            'regex' => 'மொபைல் எண்ணின் வடிவமைப்பு தவறானது.',
        ],
        'address' => [
            'required' => 'முகவரி புலம் அவசியம்.',
        ],
        'zip' => [
            'required' => 'பின்கோடு புலம் அவசியம்.',
            'min' => 'பின்கோடு குறைந்தது 5 இலக்கங்கள் இருக்க வேண்டும்.',
            'numeric' => 'பின்கோடு எண்களாக இருக்க வேண்டும்.',
        ],
        'email' => [
            'required' => 'மின்னஞ்சல் புலம் அவசியம்.',
            'email' => 'மின்னஞ்சல் சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்.',
            'unique' => 'இந்த மின்னஞ்சல் ஏற்கனவே எடுத்துக் கொண்டுள்ளது.',
        ],
    ],

    'contact_request' => [
        'conName' => 'பெயர் புலம் அவசியம்.',
        'email' => 'மின்னஞ்சல் புலம் அவசியம்.',
        'conmessage' => 'செய்தி புலம் அவசியம்.',
        'Mobile' => 'மொபைல் புலம் அவசியம்.',
        'country_code' => 'மொபைல் புலம் அவசியம்.',
        'demoname' => 'பெயர் புலம் அவசியம்.',
        'demomessage' => 'செய்தி புலம் அவசியம்.',
        'demoemail' => 'மின்னஞ்சல் புலம் அவசியம்.',
        'congg-recaptcha-response-1.required' => 'ரோபோ ஒப்புதல் தோல்வி. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.',
        'demo-recaptcha-response-1.required' => 'ரோபோ ஒப்புதல் தோல்வி. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.',
    ],

    'frontend_pages' => [
        'name' => [
            'required' => 'பெயர் புலம் அவசியம்.',
            'unique' => 'இந்த பெயர் ஏற்கனவே உள்ளது.',
            'max' => 'பெயர் 20 எழுத்துகளுக்கு மேல் இருக்க முடியாது.',
            'regex' => 'பெயர் მხოლოდ எழுத்துகள் மற்றும் இடைவெளிகளை மட்டுமே கொண்டிருக்கும்.',
        ],
        'publish' => [
            'required' => 'பதிவு புலம் அவசியம்.',
        ],
        'slug' => [
            'required' => 'ஸ்லக் புலம் அவசியம்.',
        ],
        'url' => [
            'required' => 'URL புலம் அவசியம்.',
            'url' => 'URL சரியான லிங்காக இருக்க வேண்டும்.',
            'regex' => 'URL வடிவமைப்பு தவறானது.',
        ],
        'content' => [
            'required' => 'உள்ளடக்கம் புலம் அவசியம்.',
        ],
        'created_at' => [
            'required' => 'இருக்கப்பட்ட தேதி புலம் அவசியம்.',
        ],
    ],

    'order_form' => [
        'client' => [
            'required' => 'வாடிக்கையாளர் புலம் அவசியம்.',
        ],
        'payment_method' => [
            'required' => 'பணம் செலுத்தும் முறை புலம் அவசியம்.',
        ],
        'promotion_code' => [
            'required' => 'பிரச்சாரம் குறியீடு புலம் அவசியம்.',
        ],
        'order_status' => [
            'required' => 'ஆர்டர் நிலை புலம் அவசியம்.',
        ],
        'product' => [
            'required' => 'பொருள் புலம் அவசியம்.',
        ],
        'subscription' => [
            'required' => 'பதிவு புலம் அவசியம்.',
        ],
        'price_override' => [
            'numeric' => 'விலையேற்றம் எண்களாக இருக்க வேண்டும்.',
        ],
        'qty' => [
            'integer' => 'அளவு முழு எண் ஆக இருக்க வேண்டும்.',
        ],
    ],

    'coupon_form' => [
        'code' => [
            'required' => 'கூப்பன் குறியீடு புலம் அவசியம்.',
            'string' => 'கூப்பன் குறியீடு ஒரு வரி ஆக இருக்க வேண்டும்.',
            'max' => 'கூப்பன் குறியீடு 255 எழுத்துகளுக்கு மேல் இருக்க முடியாது.',
        ],
        'type' => [
            'required' => 'வகை புலம் அவசியம்.',
            'in' => 'தவறான வகை. அனுமதிக்கப்பட்ட மதிப்புகள்: சதவீதம், மற்ற_வகை.',
        ],
        'applied' => [
            'required' => 'பொருளுக்கு பயன்படுத்தப்பட்ட புலம் அவசியம்.',
            'date' => 'பொருளுக்கு பயன்படுத்தப்பட்ட புலம் சரியான தேதி ஆக இருக்க வேண்டும்.',
        ],
        'uses' => [
            'required' => 'பயன்பாடுகள் புலம் அவசியம்.',
            'numeric' => 'பயன்பாடுகள் புலம் எண்களாக இருக்க வேண்டும்.',
            'min' => 'பயன்பாடுகள் புலம் குறைந்தது :min இருக்க வேண்டும்.',
        ],
        'start' => [
            'required' => 'தொடக்கம் புலம் அவசியம்.',
            'date' => 'தொடக்கம் புலம் சரியான தேதி ஆக இருக்க வேண்டும்.',
        ],
        'expiry' => [
            'required' => 'காலாவதி புலம் அவசியம்.',
            'date' => 'காலாவதி புலம் சரியான தேதி ஆக இருக்க வேண்டும்.',
            'after' => 'காலாவதி தேதி தொடக்கத் தேதிக்குப் பின்பாக இருக்க வேண்டும்.',
        ],
        'value' => [
            'required' => 'தள்ளுபடி மதிப்பு புலம் அவசியம்.',
            'numeric' => 'தள்ளுபடி மதிப்பு புலம் எண்களாக இருக்க வேண்டும்.',
            'between' => 'தள்ளுபடி மதிப்பு புலம் :min மற்றும் :max இடையில் இருக்க வேண்டும், இது சதவீதம் வகையாக இருக்கும்போது.',
        ],
    ],

    'tax_form' => [
        'name' => [
            'required' => 'பெயர் புலம் அவசியம்.',
        ],
        'rate' => [
            'required' => 'விகிதம் புலம் அவசியம்.',
            'numeric' => 'விகிதம் எண்களாக இருக்க வேண்டும்.',
        ],
        'level' => [
            'required' => 'தரம் புலம் அவசியம்.',
            'integer' => 'தரம் முழு எண் ஆக இருக்க வேண்டும்.',
        ],
        'country' => [
            'required' => 'நாடு புலம் அவசியம்.',
        ],
        'state' => [
            'required' => 'மாநிலம் புலம் அவசியம்.',
        ],
    ],
    //Product
    'subscription_form' => [
        'name' => [
            'required' => 'பெயர் புலம் அவசியம்.',
        ],
        'subscription' => [
            'required' => 'பதிவுகள் புலம் அவசியம்.',
        ],
        'regular_price' => [
            'required' => 'பொதுவான விலை புலம் அவசியம்.',
            'numeric' => 'பொதுவான விலை எண் ஆக இருக்க வேண்டும்.',
        ],
        'selling_price' => [
            'required' => 'விற்பனை விலை புலம் அவசியம்.',
            'numeric' => 'விற்பனை விலை எண் ஆக இருக்க வேண்டும்.',
        ],
        'products' => [
            'required' => 'பொருட்கள் புலம் அவசியம்.',
        ],
    ],

    'bundle' => [
        'name' => [
            'required' => 'பெயர் புலம் அவசியம்.',
        ],
        'items' => [
            'required' => 'ஒவ்வொரு பொருளும் அவசியம்.',
        ],
    ],

    'group' => [
        'name' => [
            'required' => 'பெயர் புலம் அவசியம்.',
        ],
        'features' => [
            'name' => [
                'required' => 'எல்லா அம்சங்களும் புலம் அவசியம்.',
            ],
        ],
        'price' => [
            'name' => [
                'required_unless' => 'விலை புலம் அவசியம்.',
            ],
        ],
        'value' => [
            'name' => [
                'required_unless' => 'மதிப்பு புலம் அவசியம்.',
            ],
        ],
        'type' => [
            'required_with' => 'வகை புலம் அவசியம்.',
        ],
        'title' => [
            'required_with' => 'தலைப்பு புலம் அவசியம்.',
        ],
    ],

    'product' => [
        'name' => [
            'required' => 'பெயர் புலம் அவசியம்.',
        ],
        'type' => [
            'required' => 'வகை புலம் அவசியம்.',
        ],
        'group' => [
            'required' => 'குழு புலம் அவசியம்.',
        ],
        'subscription' => [
            'required' => 'பதிவு புலம் அவசியம்.',
        ],
        'currency' => [
            'required' => 'கரென்சி புலம் அவசியம்.',
        ],
        'file' => [
            'required_without_all' => 'படிமம் அல்லது கோப்பு கொடுக்கப்படாதால் கோப்பு புலம் அவசியம்.',
            'mimes' => 'கோப்பு ஒரு zip கோப்பாக இருக்க வேண்டும்.',
        ],
        'image' => [
            'required_without_all' => 'படம் அல்லது கோப்பு கொடுக்கப்படாதால் படம் புலம் அவசியம்.',
            'mimes' => 'படம் ஒரு PNG கோப்பாக இருக்க வேண்டும்.',
        ],
        'github_owner' => [
            'required_without_all' => 'GitHub உரிமையாளர் புலம் கோப்பு அல்லது படம் கொடுக்கப்படாதால் அவசியம்.',
        ],
        'github_repository' => [
            'required_without_all' => 'GitHub கொள்குறி புலம் கோப்பு அல்லது படம் கொடுக்கப்படாதால் அவசியம்.',
            'required_if' => 'GitHub கொள்குறி புலம் வகை 2 என்றால் அவசியம்.',
        ],
    ],

    //User
    'users' => [
        'first_name' => [
            'required' => 'முதல் பெயர் புலம் அவசியம்.',
        ],
        'last_name' => [
            'required' => 'கடைசி பெயர் புலம் அவசியம்.',
        ],
        'company' => [
            'required' => 'நிறுவன புலம் அவசியம்.',
        ],
        'email' => [
            'required' => 'மின்னஞ்சல் புலம் அவசியம்.',
            'email' => 'மின்னஞ்சல் சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்.',
            'unique' => 'இந்த மின்னஞ்சல் ஏற்கனவே எடுத்துக் கொண்டுள்ளது.',
        ],
        'address' => [
            'required' => 'முகவரி புலம் அவசியம்.',
        ],
        'mobile' => [
            'required' => 'மொபைல் புலம் அவசியம்.',
        ],
        'country' => [
            'required' => 'நாடு புலம் அவசியம்.',
            'exists' => 'தேர்ந்தெடுக்கப்பட்ட நாடு தவறானது.',
        ],
        'state' => [
            'required_if' => 'இந்தியாவாக இருக்குமானால் மாநில புலம் அவசியம்.',
        ],
        'timezone_id' => [
            'required' => 'நேரப் பகுதி புலம் அவசியம்.',
        ],
        'user_name' => [
            'required' => 'பயனரின் பெயர் புலம் அவசியம்.',
            'unique' => 'இந்த பயனரின் பெயர் ஏற்கனவே எடுத்துக் கொண்டுள்ளது.',
        ],
        'zip' => [
            'regex' => 'இந்தியாவாக இருக்குமானால் மாநில புலம் அவசியம்.',
        ],
    ],
    // Profile Form
    'profile_form' => [
        'first_name' => [
            'required' => 'முதல் பெயர் புலம் அவசியம்.',
            'min' => 'முதல் பெயர் குறைந்தது :min எழுத்துக்களை கொண்டிருக்க வேண்டும்.',
            'max' => 'முதல் பெயர் :max எழுத்துக்களுக்கும் மீறக்கூடாது.',
        ],
        'last_name' => [
            'required' => 'கடைசி பெயர் புலம் அவசியம்.',
            'max' => 'கடைசி பெயர் :max எழுத்துக்களுக்கும் மீறக்கூடாது.',
        ],
        'company' => [
            'required' => 'நிறுவன பெயர் புலம் அவசியம்.',
            'max' => 'நிறுவன பெயர் :max எழுத்துக்களுக்கும் மீறக்கூடாது.',
        ],
        'email' => [
            'required' => 'மின்னஞ்சல் புலம் அவசியம்.',
            'email' => 'சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்.',
            'unique' => 'இந்த மின்னஞ்சல் முகவரி ஏற்கனவே எடுத்துக் கொண்டுள்ளது. வேறு மின்னஞ்சல் முகவரியைத் தேர்ந்தெடுக்கவும்.',
        ],
        'mobile' => [
            'required' => 'மொபைல் எண் புலம் அவசியம்.',
            'regex' => 'சரியான மொபைல் எண்ணை உள்ளிடவும்.',
            'min' => 'மொபைல் எண் குறைந்தது :min எழுத்துக்களை கொண்டிருக்க வேண்டும்.',
            'max' => 'மொபைல் எண் :max எழுத்துக்களுக்கும் மீறக்கூடாது.',
        ],
        'address' => [
            'required' => 'முகவரி புலம் அவசியம்.',
        ],
        'user_name' => [
            'required' => 'பயனர் பெயர் புலம் அவசியம்.',
            'unique' => 'இந்த பயனர் பெயர் ஏற்கனவே எடுத்துக் கொண்டுள்ளது.',
        ],
        'timezone_id' => [
            'required' => 'நேரப் பகுதி புலம் அவசியம்.',
        ],
        'country' => [
            'required' => 'நாடு புலம் அவசியம்.',
            'exists' => 'தேர்ந்தெடுக்கப்பட்ட நாடு தவறானது.',
        ],
        'state' => [
            'required_if' => 'இந்தியாவாக இருந்தால், மாநில புலம் அவசியம்.',
        ],
        'old_password' => [
            'required' => 'பழைய கடவுச்சொல் புலம் அவசியம்.',
            'min' => 'பழைய கடவுச்சொல் குறைந்தது :min எழுத்துக்களை கொண்டிருக்க வேண்டும்.',
        ],
        'new_password' => [
            'required' => 'புதிய கடவுச்சொல் புலம் அவசியம்.',
            'different' => 'புதிய கடவுச்சொல் பழைய கடவுச்சொல்லுக்கு வேறுபட்டது இருக்க வேண்டும்.',
        ],
        'confirm_password' => [
            'required' => 'கடவுச்சொல் உறுதிப்பத்திரம் புலம் அவசியம்.',
            'same' => 'உறுதிப்பத்திரமான கடவுச்சொல் புதிய கடவுச்சொல்லுடன் பொருந்த வேண்டும்.',
        ],
        'terms' => [
            'required' => 'நீங்கள் விதிகளைக் கையாள வேண்டும்.',
        ],
        'password' => [
            'required' => 'கடவுச்சொல் புலம் அவசியம்.',
        ],
        'password_confirmation' => [
            'required' => 'கடவுச்சொல் உறுதிப்பத்திரம் புலம் அவசியம்.',
            'same' => 'கடவுச்சொற்கள் பொருந்தவில்லை.',
        ],
        'mobile_code' => [
            'required' => 'நாடு குறியீட்டை (மொபைல்) உள்ளிடவும்.',
        ],
    ],

    // Invoice Form
    'invoice' => [
        'user' => [
            'required' => 'வாடிக்கையாளர்கள் புலம் அவசியம்.',
        ],
        'date' => [
            'required' => 'தேதி புலம் அவசியம்.',
            'date' => 'தேதி சரியான தேதி ஆக இருக்க வேண்டும்.',
        ],
        'domain' => [
            'regex' => 'இணையதள வடிவம் தவறானது.',
        ],
        'plan' => [
            'required_if' => 'பதிவுக்கான புலம் அவசியம்.',
        ],
        'price' => [
            'required' => 'விலை புலம் அவசியம்.',
        ],
        'product' => [
            'required' => 'பொருள் புலம் அவசியம்.',
        ],
    ],

    // LocalizedLicense Form
    'domain_form' => [
        'domain' => [
            'required' => 'இணையதள புலம் அவசியம்.',
            'url' => 'இணையதள சரியான URL ஆக இருக்க வேண்டும்.',
        ],
    ],

    // Product Renewal Form
    'product_renewal' => [
        'domain' => [
            'required' => 'இணையதள புலம் அவசியம்.',
            'no_http' => 'இணையதளத்தில் "http" அல்லது "https" இருக்கக்கூடாது.',
        ],
    ],

    // Language Form
    'language' => [
        'required' => 'மொழி புலம் அவசியம்.',
        'invalid' => 'தேர்ந்தெடுக்கப்பட்ட மொழி தவறானது.',
    ],

    // UpdateStoragePathRequest Form
    'storage_path' => [
        'disk' => [
            'required' => 'ஸ்டோரேஜ் டிஸ்க் புலம் அவசியம்.',
            'string' => 'டிஸ்க் ஒரு சரத்tring ஆக இருக்க வேண்டும்.',
        ],
        'path' => [
            'string' => 'பாதை ஒரு சரத்tring ஆக இருக்க வேண்டும்.',
            'nullable' => 'பாதை புலம் விருப்பமானது.',
        ],
    ],

    // ValidateSecretRequest Form
    'validate_secret' => [
        'totp' => [
            'required' => 'குறியீட்டை உள்ளிடவும்.',
            'digits' => 'சரியான 6 இலக்கக் குறியீட்டை உள்ளிடவும்.',
        ],
    ],

    // VerifyOtp Form
    'verify_email' => [
        'required' => 'மின்னஞ்சல் புலம் அவசியம்.',
        'email' => 'மின்னஞ்சல் சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்.',
        'verify_email' => 'மின்னஞ்சல் சரிபார்ப்பு தோல்வியடைந்தது.',
    ],

    'verify_country_code' => [
        'required' => 'நாடு குறியீடு புலம் அவசியம்.',
        'numeric' => 'நாடு குறியீடு ஒரு சரியான எண் ஆக இருக்க வேண்டும்.',
        'verify_country_code' => 'நாடு குறியீடு சரிபார்ப்பு தோல்வியடைந்தது.',
    ],

    'verify_number' => [
        'required' => 'எண் புலம் அவசியம்.',
        'numeric' => 'எண் சரியான எண் ஆக இருக்க வேண்டும்.',
        'verify_number' => 'எண் சரிபார்ப்பு தோல்வியடைந்தது.',
    ],

    'password_otp' => [
        'required' => 'கடவுச்சொல் புலம் அவசியம்.',
        'password' => 'கடவுச்சொல் தவறானது.',
        'invalid' => 'தவறான கடவுச்சொல்.',
    ],

    //AuthController file
    'auth_controller' => [
        'name_required' => 'பெயர் அவசியம்.',
        'name_max' => 'பெயர் 255 எழுத்துகளை விட அதிகமாக இருக்கக்கூடாது.',

        'email_required' => 'மின்னஞ்சல் அவசியம்.',
        'email_email' => 'சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்.',
        'email_max' => 'மின்னஞ்சல் 255 எழுத்துகளை விட அதிகமாக இருக்கக்கூடாது.',
        'email_unique' => 'இந்த மின்னஞ்சல் ஏற்கனவே பதிவு செய்யப்பட்டுள்ளது.',

        'password_required' => 'கடவுச்சொல் அவசியம்.',
        'password_confirmed' => 'கடவுச்சொல் உறுதி பொருந்தவில்லை.',
        'password_min' => 'கடவுச்சொல் குறைந்தது 6 எழுத்துகளாக இருக்க வேண்டும்.',
    ],

    'resend_otp' => [
        'eid_required' => 'EID புலம் அவசியம்.',
        'eid_string' => 'EID ஒரு சரம் ஆக இருக்க வேண்டும்.',
        'type_required' => 'பொருள் புலம் அவசியம்.',
        'type_string' => 'பொருள் ஒரு சரம் ஆக இருக்க வேண்டும்.',
        'type_in' => 'தேர்ந்தெடுக்கப்பட்ட வகை செல்லுபடியானது அல்ல.',
    ],

    'verify_otp' => [
        'eid_required' => 'பணியாளர் ஐடி அவசியம்.',
        'eid_string' => 'பணியாளர் ஐடி ஒரு சரம் ஆக இருக்க வேண்டும்.',
        'otp_required' => 'OTP அவசியம்.',
        'otp_size' => 'OTP சரியாக 6 எழுத்துகளாக இருக்க வேண்டும்.',
        'recaptcha_required' => 'க்ராப்சா முழுமையாக பூர்த்தி செய்யவும்.',
        'recaptcha_size' => 'க்ராப்சா பதில் செல்லுபடியானது அல்ல.',
    ],

    'company_validation' => [
        'company_required' => 'நிறுவனத்தின் பெயர் அவசியம்.',
        'company_string' => 'நிறுவனம் உரை வடிவில் இருக்க வேண்டும்.',
        'address_required' => 'முகவரி அவசியம்.',
        'address_string' => 'முகவரி உரை வடிவில் இருக்க வேண்டும்.',
    ],

    'token_validation' => [
        'token_required' => 'கோப்பான் அவசியம்.',
        'password_required' => 'கடவுச்சொல் புலம் அவசியம்.',
        'password_confirmed' => 'கடவுச்சொல் உறுதி பொருந்தவில்லை.',
    ],

    'custom_email' => [
        'required' => 'மின்னஞ்சல் புலம் அவசியம்.',
        'email' => 'சரியான மின்னஞ்சல் முகவரியை உள்ளிடவும்.',
        'exists' => 'இந்த மின்னஞ்சல் எங்களுடன் பதிவு செய்யப்படவில்லை.',
    ],

    'newsletterEmail' => [
        'required' => 'செய்தி மின்னஞ்சல் புலம் அவசியம்.',
        'email' => 'செய்தி மின்னஞ்சல் செல்லுபடியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்.',
    ],

    'widget' => [
        'name_required' => 'பெயர் அவசியம்.',
        'name_max' => 'பெயர் 50 எழுத்துகளை விட அதிகமாக இருக்கக்கூடாது.',
        'publish_required' => 'பதிவிறக்கம் நிலை அவசியம்.',
        'type_required' => 'வகை அவசியம்.',
        'type_unique' => 'இந்த வகை ஏற்கனவே இருக்கிறது.',
    ],

    'payment' => [
        'payment_date_required' => 'கட்டண தேதி அவசியம்.',
        'payment_method_required' => 'கட்டண முறை அவசியம்.',
        'amount_required' => 'பொது தொகை அவசியம்.',
    ],

    'custom_date' => [
        'date_required' => 'தேதி புலம் அவசியம்.',
        'total_required' => 'மொத்த புலம் அவசியம்.',
        'status_required' => 'நிலைப்படுத்தல் புலம் அவசியம்.',
    ],

    'plan_renewal' => [
        'plan_required' => 'திட்டம் புலம் அவசியம்.',
        'payment_method_required' => 'கட்டண முறை புலம் அவசியம்.',
        'cost_required' => 'செலவு புலம் அவசியம்.',
        'code_not_valid' => 'பிரச்சனை குறியீடு செல்லுபடியானது அல்ல.',
    ],

    'rate' => [
        'required' => 'விகிதம் அவசியம்.',
        'numeric' => 'விகிதம் ஒரு எண் ஆக இருக்க வேண்டும்.',
    ],

    'product_validate' => [
        'producttitle_required' => 'பொருள் தலைப்பு அவசியம்.',
        'version_required' => 'பதிப்பு அவசியம்.',
        'filename_required' => 'தயவுசெய்து ஒரு கோப்பை பதிவேற்றவும்.',
        'dependencies_required' => 'சம்பந்தப்பட்ட புலம் அவசியம்.',
    ],
    'product_sku_unique' => 'பொருள் SKU தனித்துவமாக இருக்க வேண்டும்',
    'product_name_unique' => 'பெயர் தனித்துவமாக இருக்க வேண்டும்',
    'product_show_agent_required' => 'உங்கள் கார் பக்கம் விருப்பத்தைத் தேர்ந்தெடுக்கவும்',
    'product_controller' => [
        'name_required' => 'பொருள் பெயர் அவசியம்.',
        'name_unique' => 'பெயர் தனித்துவமாக இருக்க வேண்டும்.',
        'type_required' => 'பொருள் வகை அவசியம்.',
        'description_required' => 'பொருள் விளக்கம் அவசியம்.',
        'product_description_required' => 'விரிவான பொருள் விளக்கம் அவசியம்.',
        'image_mimes' => 'படம் கோப்பு வகை: jpeg, png, jpg ஆக இருக்க வேண்டும்.',
        'image_max' => 'படம் 2048 கிலோபைட்டுகளை விட அதிகமாக இருக்கக்கூடாது.',
        'product_sku_required' => 'பொருள் SKU அவசியம்.',
        'group_required' => 'பொருள் குழு அவசியம்.',
        'show_agent_required' => 'உங்கள் கார் பக்கம் விருப்பத்தைத் தேர்ந்தெடுக்கவும்.',
    ],

    'current_domain_required' => 'தற்போதைய டொமைன் அவசியம்.',
    'new_domain_required' => 'புதிய டொமைன் அவசியம்.',
    'special_characters_not_allowed' => 'டொமைன் பெயரில் சிறப்பு எழுத்துக்கள் அனுமதிக்கப்படவில்லை',
    'orderno_required' => 'ஆர்டர் எண் அவசியம்.',
    'cloud_central_domain_required' => 'கிளவுட் சென்ட்ரல் டொமைன் அவசியம்.',
    'cloud_cname_required' => 'கிளவுட் CNAME அவசியம்.',
    'cloud_tenant' => [
        'cloud_top_message_required' => 'கிளவுட் மேல் செய்தி அவசியம்.',
        'cloud_label_field_required' => 'கிளவுட் லேபல் புலம் அவசியம்.',
        'cloud_label_radio_required' => 'கிளவுட் லேபல் ரேடியோ அவசியம்.',
        'cloud_product_required' => 'கிளவுட் பொருள் அவசியம்.',
        'cloud_free_plan_required' => 'கிளவுட் இலவச திட்டம் அவசியம்.',
        'cloud_product_key_required' => 'கிளவுட் பொருள் விசை அவசியம்.',
    ],

    'reg_till_after' => 'பதிவு செய்யும் வரை தேதி பதிவு செய்யும் தேதி பின்னர் இருக்க வேண்டும்.',
    'extend_product' => [
        'title_required' => 'தலைப்பு புலம் அவசியம்.',
        'version_required' => 'பதிப்பு புலம் அவசியம்.',
        'dependencies_required' => 'சம்பந்தப்பட்ட புலம் அவசியம்.',
    ],

    'please_enter_recovery_code' => 'மீட்பு குறியீட்டை உள்ளிடவும்',
    'social_login' => [
        'client_id_required' => 'Google, Github அல்லது Linkedin க்கான Client ID அவசியம்.',
        'client_secret_required' => 'Google, Github அல்லது Linkedin க்கான Client Secret அவசியம்.',
        'api_key_required' => 'Twitter க்கான API விசை அவசியம்.',
        'api_secret_required' => 'Twitter க்கான API ரகசிய விசை அவசியம்.',
        'redirect_url_required' => 'விசாரணை URL அவசியம்.',
    ],

    'thirdparty_api' => [
        'app_name_required' => 'பயன்பாட்டு பெயர் அவசியம்.',
        'app_key_required' => 'பயன்பாட்டு விசை அவசியம்.',
        'app_key_size' => 'பயன்பாட்டு விசை குறிப்பிட்ட 32 எழுத்துகளாக இருக்க வேண்டும்.',
        'app_secret_required' => 'பயன்பாட்டு ரகசிய விசை அவசியம்.',
    ],
    'plan_request' => [
        'name_required' => 'பெயர் புலம் தேவையானது',
        'product_quant_req' => 'பொருள் அளவு புலம், முகவர்களின் எண்ணிக்கை இல்லாதபோது தேவை',
        'no_agent_req' => 'முகவர்களின் எண்ணிக்கை புலம், பொருள் அளவு இல்லாதபோது தேவை',
        'pro_req' => 'பொருள் புலம் தேவையானது',
        'offer_price' => 'சலுகை விலை 100 க்கும் மேல் இருக்கக்கூடாது',
    ],
    'razorpay_val' => [
        'business_required' => 'வணிக புலம் அவசியம்.',
        'cmd_required' => 'கட்டளை புலம் அவசியம்.',
        'paypal_url_required' => 'பேபால் URL அவசியம்.',
        'paypal_url_invalid' => 'பேபால் URL சரியான URL ஆக இருக்க வேண்டும்.',
        'success_url_invalid' => 'வெற்றிக் URL சரியான URL ஆக இருக்க வேண்டும்.',
        'cancel_url_invalid' => 'ரத்து URL சரியான URL ஆக இருக்க வேண்டும்.',
        'notify_url_invalid' => 'அறிவிப்பு URL சரியான URL ஆக இருக்க வேண்டும்.',
        'currencies_required' => 'நாணய புலம் அவசியம்.',
    ],

];
